### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [23]:
# Dependencies and Setup
import pandas as pd
import numpy as np


# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

In [24]:
df.head().style.format({"Price": "${:0,.2f}", })

In [25]:
df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [26]:
df['Price'].astype('int')

0      3
1      1
2      4
3      3
4      1
      ..
775    3
776    1
777    3
778    4
779    4
Name: Price, Length: 780, dtype: int64

In [27]:
df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

## Player Count

* Display the total number of players

In [28]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [29]:
total_players = len(df["SN"].value_counts())

pd.DataFrame([total_players],columns = ["Total Players"])

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [30]:
unique_items = len(df["Item Name"].unique())
average_price = df["Price"].mean()
num_purchases = len(df["Purchase ID"].value_counts())
total_revenue = df["Price"].sum()

In [31]:
analysis = pd.DataFrame({"Unique Items": [unique_items],
              "Average Price": [average_price],
             "Number of Purchases": [num_purchases],
             "Total Revenue": [total_revenue]})

In [32]:
analysis["Average Price"]= analysis["Average Price"].map("${:.2f}".format)

In [33]:
analysis["Total Revenue"]= analysis["Total Revenue"].map("${:.2f}".format)

In [34]:
analysis

   Unique Items Average Price  Number of Purchases Total Revenue
0           179         $3.05                  780      $2379.77

## Gender Demographics

In [35]:
gender_test = df[["SN", "Gender"]]

gender_test = gender_test.drop_duplicates()

In [50]:
gender_demographics_test = gender_test.groupby("Gender")

gender_demographics_test.count().head(10)

percentage = pd.DataFrame({'Percentage': df.groupby(('Gender')).size() / len(df)})

                       Percentage
Gender
Female                   0.144872
Male                     0.835897
Other / Non-Disclosed    0.019231

In [45]:
percentage_df = pd.crosstab(index=df['SN'], columns=df['Gender'])
print(percentage_df)

<bound method DataFrame.sum of Gender         Female  Male  Other / Non-Disclosed
SN
Adairialis76        0     1                      0
Adastirin33         1     0                      0
Aeda94              0     1                      0
Aela59              0     1                      0
Aelaria33           0     1                      0
...               ...   ...                    ...
Yathecal82          3     0                      0
Yathedeu43          0     2                      0
Yoishirrala98       1     0                      0
Zhisrisu83          0     2                      0
Zontibe81           0     3                      0

[576 rows x 3 columns]>

                       Percentage
Gender
Female                   0.144872
Male                     0.835897
Other / Non-Disclosed    0.019231

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [20]:
gender_demographics_test.describe()

                         SN
                      count unique           top freq
Gender
Female                  113     81    Umolrian85    3
Male                    652    484     Lisosia93    5
Other / Non-Disclosed    15     11  Siarithria38    2


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [60]:
purchase_analysis = df.groupby(["Gender"])

In [61]:
purchase_value = purchase_analysis["Price"].sum()

In [62]:
purchase_count = purchase_analysis["Price"].count()

In [63]:
purchase_price = purchase_analysis["Price"].mean()

In [64]:
purchase_analysis_df = pd.DataFrame({"Purchase Count": purchase_count,
                                    "Average Purchase Price": purchase_price,
                                    "Total Purchase Value": purchase_value })

In [65]:
purchase_analysis_df.head()

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [66]:
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]


df["Age Demographics"]= pd.cut(df["Age"], age_bins, labels=group_names)
demographic_group =df.groupby("Age Demographics")

df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Demographics
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [68]:
top_spenders = df['Item ID'].groupby(df['SN']).count()


top_spenders= pd.DataFrame(data=top_spenders)
top_spenders.columns = ['Purchase Count']

top_spenders['Average Purchase Price'] = round(df['Price'].groupby(df['SN']).mean(),2)
top_spenders['Total Purchase Value'] = df['Price'].groupby(df['SN']).sum()


top_spenders.sort_values(by=['Total Purchase Value'], ascending=False, inplace=True)

top_spenders['Average Purchase Price'] = top_spenders['Average Purchase Price'].map('${:,.2f}'.format)
top_spenders['Total Purchase Value'] = top_spenders['Total Purchase Value'].map('${:,.2f}'.format)

top_spenders.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [72]:

popular_items = df.groupby(['Item ID', 'Item Name','Price'])['Price'].agg(['count','sum'])
popular_items.columns = ['Purchase Count', 'Total Purchase Value']

popular_items.reset_index(inplace=True)
popular_items.set_index(['Item ID','Item Name'] ,inplace=True)

most_items = popular_items[['Purchase Count', 'Price', 'Total Purchase Value']]
most_popular_items = most_items.sort_values(by='Purchase Count', ascending=False)

most_popular_items['Price'] = most_popular_items['Price'].map('${:,.2f}'.format)
most_popular_items['Total Purchase Value'] = most_popular_items['Total Purchase Value'].map('${:,.2f}'.format)

most_popular_items.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
145,Fiery Glass Crusader,9,$4.58,$41.22
82,Nirvana,9,$4.90,$44.10
37,"Shadow Strike, Glory of Ending Hope",8,$3.16,$25.28

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [75]:

profitable_items = most_popular_items.sort_values(by='Total Purchase Value', ascending=False)

In [80]:
profitable_items.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,2,$4.99,$9.98
29,"Chaos, Ender of the End",5,$1.98,$9.90
173,Stormfury Longsword,2,$4.93,$9.86
1,Crucifer,3,$3.26,$9.78
38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48